app/Http/helpers.php

function getWishlistUser(){

    $uid = auth()->user()->id;
    $wishlistItems = Wishlist::where('user_id', $uid)->pluck('product_id');

    $products = Product::with('translations:id,product_id,name,locale,slug')
        ->whereIn( 'id', $wishlistItems )
        ->select ( 'id', 'thumbnail', 'price' )
        ->get();
---
select `product_id` from `wishlist` where `user_id` = 1
select `id`, `thumbnail`, `price` from `products` where 0 = 1

function getWishSession(){

    $wishlist = (session()->has('products.wishlist'))
        ? session()->get('products.wishlist'):
        [];

    $products = Product::with('translations:id,product_id,name,locale,slug')
        ->whereIn( 'id', array_keys($wishlist) )
        ->select ( 'id', 'thumbnail', 'price' )
        ->get();
---
select `id`, `thumbnail`, `price` from `products` where 0 = 1

function getWishListsProductsId()
{
    $ids = [];
    $wishlist = (session()->has('products.wishlist'))
        ? session()->get('products.wishlist'):
        [];

    $products = Product::with('translations:id,product_id,name,locale,slug')
        ->whereIn( 'id', array_keys($wishlist) )
        ->select ( 'id', 'thumbnail', 'price' )
        ->get();
---
select `id`, `thumbnail`, `price` from `products` where 0 = 1

function get_priroty_array()
{
    return [
            'combo_order_id'=>\App\Periorty::where('name','combo')->first()->order_id,
            'on_sale_order_id'=>\App\Periorty::where('name','on_sale')->first()->order_id,
            'hot_order_id'=>\App\Periorty::where('name','hot')->first()->order_id,
            'promotion_order_id'=>\App\Periorty::where('name','promotion')->first()->order_id,
            'bundle_order_id'=>\App\Periorty::where('name','bundle')->first()->order_id,
            'coupon_order_id'=>\App\Periorty::where('name','coupon')->first()->order_id
        ];
---
select * from `periorties` where `name` = 'combo' limit 1
select * from `periorties` where `name` = 'on_sale' limit 1
select * from `periorties` where `name` = 'hot' limit 1
select * from `periorties` where `name` = 'promotion' limit 1
select * from `periorties` where `name` = 'bundle' limit 1
select * from `periorties` where `name` = 'coupon' limit 1

function get_product_priroty_array($id)
{
        $priroty = get_priroty_array();
        $product=\App\Product::find($id);
        $offer=[];
        if ($product->is_bundle) {
            $offer['bundle_order_id']=$priroty['bundle_order_id'];
        }
        if (count($product->promotions()->get()) > 0) {
            $offer['promotion_order_id']=$priroty['promotion_order_id'];
        }
        if ($product->on_sale) {
            $offer['on_sale_order_id']=$priroty['on_sale_order_id'];
        }
        if ($product->is_hot) {
            $offer['hot_order_id']=$priroty['hot_order_id'];
        }
        if (count($product->cupons()->get()) > 0) {
---
select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232
select `cupons`.*, `cupon_product`.`product_id` as `pivot_product_id`, `cupon_product`.`cupon_id` as `pivot_cupon_id` from `cupons` inner join `cupon_product` on `cupons`.`id` = `cupon_product`.`cupon_id` where `cupon_product`.`product_id` = 232

function has_cupon($id)
{
    $product=\App\Product::find($id);
    $offer=get_product_priroty_array($id);
    if (count($product->cupons()->get()) == 0 ) {
---
select `cupons`.*, `cupon_product`.`product_id` as `pivot_product_id`, `cupon_product`.`cupon_id` as `pivot_cupon_id` from `cupons` inner join `cupon_product` on `cupons`.`id` = `cupon_product`.`cupon_id` where `cupon_product`.`product_id` = 232