public/index.php

function trans($key = null, $replace = [], $locale = null)
{
    # sms.account_activation
    # sms.ad_activation

    if (is_null($key)) {
        return app('translator');
    }

    $exp = explode('.', $key, 2);
    $group = null;
    $item = $key;
    if( sizeof($exp) === 2 ) {
        $group = $exp[0];
        $item = $exp[1];
    }
    $if = \DB::table('translator_translations')->where('group', $group)->where('item', $item)->exists();
---
select exists(select * from `translator_translations` where `group` = 'home' and `item` = 'Shop by category') as `exists`