app/Order.php

    public function products_weight(){
        $order = OrderProduct::where('order_id','=',$this->id)->get();
---
select * from `order_product` where `order_id` = 55

    public function payment_method(){
        $transaction = Transaction::where('order_id','=',$this->id)->get()->first();
---
select * from `transactions` where `order_id` = 55

    public function get_shipping_request($orderline){
        $request_shipping = ShippingRequest::where('order_id','=',$this->id)->get();
---
select * from `shipping_requests` where `order_id` = 55

    public function Location2(){

        $transaction=Transaction::where('order_id',$this->id)->latest()->first();
---
select * from `transactions` where `order_id` = 55 order by `created_at` desc limit 1