app/Product.php

select * from `main_settings` where `key` = 'discount_priority'
---
    public function discount_priority(){
        $setting = MainSetting::where('key','=','discount_priority')->get()->first();

select * from `deal_sections` where `end_date` > '2020-12-01'
---
    public function get_all_discounts(){
        $discounts = [];
        $product = Product::find($this->id);
        $dealsections = DealSection::where('end_date','>',date('Y-m-d'))->get();

select * from `product_images` where `product_id` = 257
---
    public function get_images($id){
        $images_obj = [];
        $product = Product::find($id);
        if($product->thumbnail != null){
            array_push($images_obj,$product->thumbnail);
        }
        $images = ProductImage::where('product_id','=',$id)->get();

select * from `product_images` where `product_id` = 232
---
    public function get_image($id){
        $images_obj = [];
        $product = Product::find($id);
        if($product->thumbnail != null){
            array_push($images_obj,$product->thumbnail);
        }
        $images = ProductImage::where('product_id','=',$id)->get();

select count(case when rate = 5 then 1 end) as five_stars, count(case when rate = 4 then 1 end) as four_stars, count(case when rate = 3 then 1 end) as three_stars, count(case when rate = 2 then 1 end) as two_stars, count(case when rate = 1 then 1 end) as one_star from `reviews` where `item_id` = 232 and `approved` = 1 limit 1
select * from `reviews` where `item_id` = 232 and `approved` = 1
---
    public function getRateAvg(){
        $rate = Review::query()

            ->selectRaw("count(case when rate = 5 then 1 end) as five_stars")
            ->selectRaw("count(case when rate = 4 then 1 end) as four_stars")
            ->selectRaw("count(case when rate = 3 then 1 end) as three_stars")
            ->selectRaw("count(case when rate = 2 then 1 end) as two_stars")
            ->selectRaw("count(case when rate = 1 then 1 end) as one_star")
            ->where('item_id','=',$this->id)
            ->where('approved','=',1)
            ->first();
        $all=0;

        $one_star = $rate->one_star * 1;
        $two_stars = $rate->two_stars * 2;
        $three_stars = $rate->three_stars * 3;
        $four_stars = $rate->four_stars * 4;
        $five_stars = $rate->five_stars * 5;

        $all = $one_star + $two_stars + $three_stars + $four_stars + $five_stars;

        $all_c = Review::Where('item_id','=',$this->id)->where('approved','=',1)->get()->count();

select * from `attributes` where `group_id` = 1
select * from `attributes` where `id` in (7, 8)
---
    public function get_attrs_child($id,$arr){
        $attributes = Attribute::where('group_id','=',$id)->get();
        $product_attrs = [];
        $selected_attrs = [];
        foreach($arr as $ar){
            array_push($product_attrs,$ar->id);
        }
        foreach($attributes as $attribute){
            if(in_array($attribute->id,$product_attrs)){
                array_push($selected_attrs,$attribute->id);
            }
        }
        $final = Attribute::whereIn('id',$selected_attrs)->get();

select * from `attributes` where `id` in ('7')
---
    public function get_attr($arr){
        $arr = explode(",",$arr);
        if(count($arr) > 0){
            return Attribute::whereIn('id',$arr)->get();

select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232
select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232 limit 1
---
    public  function getFinalPriceAfterDiscountPriroty()
    {
        $offer=get_product_priroty_array($this->id);
        #promotion
        if (count($this->promotions()->get()) > 0) {
            if ($offer['promotion_order_id']==min($offer)) {
                $promotion=$this->promotions()->first();

select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232
---
    public function is_offer()
    {
        if (count($this->promotions()->get()) > 0) {

select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232
select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232 limit 1
---
    public  function getFinalDiscountPriroty()
    {
        if ($this->is_offer()) {
            # code...

             $offer=get_product_priroty_array($this->id);
            #promotion
            if (count($this->promotions()->get()) > 0) {
                if ($offer['promotion_order_id']==min($offer)) {
                    $promotion=$this->promotions()->first();

select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232
select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232 limit 1
---
    public  function getFinalOldPricePriroty()
    {
        if ($this->is_offer()) {
            # code...

             $offer=get_product_priroty_array($this->id);
            #promotion
            if (count($this->promotions()->get()) > 0) {
                if ($offer['promotion_order_id']==min($offer)) {
                    $promotion=$this->promotions()->first();

select `promotions`.*, `promotion_product`.`product_id` as `pivot_product_id`, `promotion_product`.`promotion_id` as `pivot_promotion_id` from `promotions` inner join `promotion_product` on `promotions`.`id` = `promotion_product`.`promotion_id` where `promotion_product`.`product_id` = 232
---
    public function offer_flag()
    {
        if ($this->is_offer()) {
            # code...

             $offer=get_product_priroty_array($this->id);
            #promotion
            if (count($this->promotions()->get()) > 0) {