app/Http/Controllers/CartController.php

    function getCart(){
        $cart = (session()->has('products.cart')) ? session()->get('products.cart') : [] ;
        $products = Product::with('translations:id,product_id,name,locale,slug')
                    ->whereIn('id', array_keys($cart))
                    ->select('id', 'thumbnail', 'price', 'stock','before_price','is_bundle','bundle_image')
                    ->get();
---
select `id`, `thumbnail`, `price`, `stock`, `before_price`, `is_bundle`, `bundle_image` from `products` where `id` in (167, 281, 260, 258, 257)