app/Http/Controllers/CheckoutController.php

    public function show()
    {
        if (Auth::user()) {
            $wallet = Wallet::where('user_id', '=', Auth::user()->id)->get()->sum('amount');
            $points = Point::where('user_id', '=', Auth::user()->id)->get()->sum('points');

            $points_value = MainSetting::where('key', '=', 'point_value')->get()->first();
---
select * from `wallet` where `user_id` = 1
select * from `points` where `user_id` = 1
select * from `main_settings` where `key` = 'point_value'

        if(count($products) == 0){
            return redirect('/'.$locale.'/cart')->with('message','no products');
        }
        $countries = Country::all();
        $cities = City::all();
        $states = State::all();
---
select * from `countries`
select * from `cities`
select * from `states`

          $proo=Product::find($item['id']);


            $category = ProductCategory::where('product_id','=',$item['id'])->get()->first();
---
select * from `product_categories` where `product_id` = 257

        $user = [];
        if(auth()->check()){
            $uid = auth()->user()->id;
            $user = UserDetail::where('user_id', '=', $uid)->first();
            // Shipping Zone Checker
            $shipping_zone = Shippingzone::all();
---
select * from `user_details` where `user_id` = 1 limit 1
select * from `shipping_zones`

            //     $nproducts['zone_id'] = $zone_id;
            //     $nproducts['totalShipping'] = $total_shipping;
            // }
            $main_settings = MainSetting::where('key','=','free_shipping')->get()->first();
---
select * from `main_settings` where `key` = 'free_shipping'

    function getCartData(){
        $cart = (session()->has('products.cart')) ? session()->get('products.cart') : [] ;
        $products = Product::with('translations:id,product_id,name,locale,slug')
                    ->whereIn('id', array_keys($cart))
                    ->select('id', 'thumbnail', 'price', 'stock','before_price','is_bundle','bundle_image')
                    ->get();
---
select `id`, `thumbnail`, `price`, `stock`, `before_price`, `is_bundle`, `bundle_image` from `products` where `id` in (281, 260, 258, 257)

               # Decrease products by the quantity
               # Product::where('id', $product['id'])->decrement('stock', $product['quantity']);
                  if($db_product->is_bundle == 0){ // to stop decrementing the stock of the bundle itself
                      $db_product->decrement('stock', $product['quantity']);
---
update `products` set `stock` = `stock` - 3, `products`.`updated_at` = '2020-12-01 16:06:41' where `id` = 257

        //    $order_find->zone_id = $request->input('zone_id');
        //    $order_find->company_id = $request->input('company_id');
           $order_find->shipping_amount = $request->input('shipping_amount');
           $order_find->save();
---
update `orders` set `shipping_amount` = '0', `orders`.`updated_at` = '2020-12-01 16:06:42' where `id` = 55

             }
           }
            //dd($productFinal);
           $order->products()->sync($productFinal);
---
insert into `order_product` (`attribute_id`, `cupon`, `discount`, `discount_type`, `order_id`, `price`, `price_after`, `product_id`, `quantity`, `reward_points`, `total`) values ('7', '', 0, '', 55, 2000, 6000, 257, 3, 0, 6000)

                $transaction->shipping_to_home=1;
           }

           $transaction->save();
---
insert into `transactions` (`user_id`, `payment_type`, `order_id`, `amount`, `shipping_to_home`, `updated_at`, `created_at`) values (1, 'Cash On Delivery', 55, 36000, 1, '2020-12-01 16:06:42', '2020-12-01 16:06:42')

    public function orderHistory(){
        $userId = auth()->user()->id;
        $orders = Order::with('products')->where('user_id', $userId)->latest()->get();
        $reasons = ReturnReason::all();
---
select * from `orders` where `user_id` = 1 order by `created_at` desc
select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`id` as `pivot_id`, `order_product`.`quantity` as `pivot_quantity`, `order_product`.`price` as `pivot_price`, `order_product`.`price_after` as `pivot_price_after`, `order_product`.`total` as `pivot_total`, `order_product`.`attribute_id` as `pivot_attribute_id`, `order_product`.`reward_points` as `pivot_reward_points`, `order_product`.`discount_type` as `pivot_discount_type` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` in (9, 10, 11, 12, 13, 14, 15, 18, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 46, 50, 51, 52, 53)
select * from `return_reasons`

    function getCart(){

        $cart = (session()->has('products.cart')) ? session()->get('products.cart') : [] ;

        $products = Product::with('translations:id,product_id,name,locale,slug')
                    ->whereIn('id', array_keys($cart))
                    ->select('id', 'thumbnail', 'price', 'is_bundle')
                    ->get();
---
select `id`, `thumbnail`, `price`, `is_bundle` from `products` where `id` in (281, 260, 258, 257)