app/Http/Controllers/SearchController.php

    public function category($category,Request $request){
        $attrs_groups = [];
        $attrs = [];

        $products_obj = [];
        $brands_obj = [];
        $manufacturers_obj = [];
        $prices_obj = [];
        $sort = $request->input('sort') ? $request->input('sort') : 'desc';
        $cat = CategoryTranslation::where('slug','=',$category)->get()->first();
        $category = Category::find($cat->category_id);
        $productsc = ProductCategory::where('category_id','=',$category->id)->orderBy('id','desc')->get();
        foreach($productsc as $product){
            if(!in_array($product->product_id,$products_obj)){
                array_push($products_obj,$product->product_id);
            }
        }
        $all_products = Product::whereIn('id',$products_obj)->where('is_active','=',1)->orderBy('price',$sort)->get();
---
select * from `category_translations` where `slug` = 'اكسسوارات'
select * from `product_categories` where `category_id` = 426 order by `id` desc
select * from `products` where `id` in (219, 282, 281, 260, 259, 258, 257, 256, 255, 254, 253, 252, 251, 250, 249, 248, 247, 246, 245, 244, 243, 242, 241, 240, 239, 238, 237, 236, 235, 234, 233, 232, 231, 230, 229, 228, 227, 226, 225, 224, 223, 222, 221, 220, 218, 217, 280, 269, 216, 215, 214, 213, 212, 162, 161, 160, 159, 158, 157, 156, 155, 154, 153, 152, 151, 150, 149, 148, 147, 146, 145, 144, 143, 142, 141, 140, 139, 138, 137, 136, 135, 134, 133, 132, 131, 130, 129, 128, 127, 126, 125, 124, 123, 122, 121, 120, 119, 118, 117, 116, 115, 114, 113, 112) and `is_active` = 1 order by `price` desc

                }
            }
        }
        $brands = Brand::whereIn('id',$brands_obj)->get();
        $manufacturers = Manufacturer::whereIn('id',$manufacturers_obj)->get();
        $products = Product::whereIn('id',$products_obj)->where('is_active','=',1)->orderBy('id',$sort)->paginate(15);
        $attrs_groups = $category->attributes()->pluck('attribute_id')->toArray();
        $attrs_groups = Attribute::whereIn('id',$attrs_groups)->where('group_id',null)->get();

        $attrs = Attribute::all();//whereIn('id',$attrs)->get();
---
select * from `brands` where `id` in (63, 67, 57, 58, 59, 60, 61, 62, 65, 66)
select * from `manufacturers` where `id` in (32, 36)
select * from `products` where `id` in (219, 282, 281, 260, 259, 258, 257, 256, 255, 254, 253, 252, 251, 250, 249, 248, 247, 246, 245, 244, 243, 242, 241, 240, 239, 238, 237, 236, 235, 234, 233, 232, 231, 230, 229, 228, 227, 226, 225, 224, 223, 222, 221, 220, 218, 217, 280, 269, 216, 215, 214, 213, 212, 162, 161, 160, 159, 158, 157, 156, 155, 154, 153, 152, 151, 150, 149, 148, 147, 146, 145, 144, 143, 142, 141, 140, 139, 138, 137, 136, 135, 134, 133, 132, 131, 130, 129, 128, 127, 126, 125, 124, 123, 122, 121, 120, 119, 118, 117, 116, 115, 114, 113, 112) and `is_active` = 1 order by `id` desc limit 15 offset 30
select count(*) as aggregate from `products` where `id` in (219, 282, 281, 260, 259, 258, 257, 256, 255, 254, 253, 252, 251, 250, 249, 248, 247, 246, 245, 244, 243, 242, 241, 240, 239, 238, 237, 236, 235, 234, 233, 232, 231, 230, 229, 228, 227, 226, 225, 224, 223, 222, 221, 220, 218, 217, 280, 269, 216, 215, 214, 213, 212, 162, 161, 160, 159, 158, 157, 156, 155, 154, 153, 152, 151, 150, 149, 148, 147, 146, 145, 144, 143, 142, 141, 140, 139, 138, 137, 136, 135, 134, 133, 132, 131, 130, 129, 128, 127, 126, 125, 124, 123, 122, 121, 120, 119, 118, 117, 116, 115, 114, 113, 112) and `is_active` = 1
select * from `attributes` where `id` in (4, 5, 6, 1) and `group_id` is null
select * from `attributes`