app/Providers/ViewComposerProvider.php

    public function boot()
    {
        view()->composer(['layouts.component._header','layouts.component._sidbar','layouts.component._category','layouts.app','website.components.header'], function ($view) {
            $locale = App::getLocale();
            $categories = Category::whereIsActive(true)->whereParentId(0)->get();

            $allcategories = Category::whereIsActive(true)->get();
            $categoryHeader = Category::whereIsActive(true)->whereInHeader(1)->get();
            $pageHeader = Page::whereIsActive(1)->whereShowHeader(1)->get();
            $pagefooter = Page::whereIsActive(1)->whereShowFooter(1)->get();
---
select * from `categories` where `is_active` = 1 and `parent_id` = 0
select * from `categories` where `is_active` = 1
select * from `categories` where `is_active` = 1 and `in_header` = 1
select * from `pages` where `is_active` = 1 and `show_header` = 1
select * from `pages` where `is_active` = 1 and `show_footer` = 1