app/Http/Controllers/Admin/OrdersController.php

    public function index()
    {

        $status_array = explode(',',Auth::user()->order_status_permissions);
        $orders = Order::whereIn('status_id',$status_array)->get();
        $main_settings = MainSetting::where('key','=','ended_orders_status')->get()->first();
---
select * from `orders` where `status_id` in ('1', '2', '3', '4', '5', '6', '7')
select * from `main_settings` where `key` = 'ended_orders_status'

    public function show($id)
    {

        $main_settings = MainSetting::where('key','=','ended_orders_status')->get()->first();

        if($main_settings){
            $main_settings = explode(',',$main_settings->value);
        }
        $order = Order::with('products')->findOrFail($id);
        $total_price = 0;
        $weights = 0;
        $counter = 0;
        $order->products->map(function (Product $product) use (&$total_price, &$weights, &$counter) {
            if($product->pivot->total != $product->pivot->price_after){
                $total_price += $product->pivot->price_after;
            }else{
                $total_price += $product->pivot->total;
            }
            $weights += (($product->length*$product->width*$product->height)/3000)*$product->pivot->quantity;
            return $product;
        });

        $shipping_zone = ShippingZone::all();
---
select * from `main_settings` where `key` = 'ended_orders_status'
select * from `orders` where `orders`.`id` = '55' limit 1
select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`id` as `pivot_id`, `order_product`.`quantity` as `pivot_quantity`, `order_product`.`price` as `pivot_price`, `order_product`.`price_after` as `pivot_price_after`, `order_product`.`total` as `pivot_total`, `order_product`.`attribute_id` as `pivot_attribute_id`, `order_product`.`reward_points` as `pivot_reward_points`, `order_product`.`discount_type` as `pivot_discount_type` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` in (55)
select * from `shipping_zones`

            }
        }
        $order->admin_viewed=1;
        $order->save();
---
update `orders` set `admin_viewed` = 1, `orders`.`updated_at` = '2020-12-01 16:08:55' where `id` = 55

    public function destroy($id)
    {
        $order = Order::findOrFail($id);
        $order->delete();
        $order->products()->detach();
        \App\Transaction::where('order_id',$order->id)->delete();
---
delete from `orders` where `id` = 54
delete from `order_product` where `order_id` = 54
delete from `transactions` where `order_id` = 54